GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_rtc.h
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_rtc.h
  * @author  FMSH Application Team
  * @brief   Head file of RTC FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_RTC_H
#define __FM33FH0XX_FL_RTC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RTC_FL_ES_INIT RTC Exported Init structures
  * @{
  */

/**
  * @brief FL RTC Init Sturcture definition
  */
typedef struct
{
    /** 年 */
    uint32_t year;
    /** 月 */
    uint32_t month;
    /** 日 */
    uint32_t day;
    /** 周 */
    uint32_t week;
    /** 时 */
    uint32_t hour;
    /** 分 */
    uint32_t minute;
    /** 秒 */
    uint32_t second;

} FL_RTC_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RTC_FL_Exported_Constants RTC Exported Constants
  * @{
  */

#define    RTC_IER_ADJ_IE_Pos                                     (12U)
#define    RTC_IER_ADJ_IE_Msk                                     (0x1U << RTC_IER_ADJ_IE_Pos)
#define    RTC_IER_ADJ_IE                                         RTC_IER_ADJ_IE_Msk

#define    RTC_IER_ALARM_IE_Pos                                   (11U)
#define    RTC_IER_ALARM_IE_Msk                                   (0x1U << RTC_IER_ALARM_IE_Pos)
#define    RTC_IER_ALARM_IE                                       RTC_IER_ALARM_IE_Msk

#define    RTC_IER_1KHZ_IE_Pos                                    (10U)
#define    RTC_IER_1KHZ_IE_Msk                                    (0x1U << RTC_IER_1KHZ_IE_Pos)
#define    RTC_IER_1KHZ_IE                                        RTC_IER_1KHZ_IE_Msk

#define    RTC_IER_256HZ_IE_Pos                                   (9U)
#define    RTC_IER_256HZ_IE_Msk                                   (0x1U << RTC_IER_256HZ_IE_Pos)
#define    RTC_IER_256HZ_IE                                       RTC_IER_256HZ_IE_Msk

#define    RTC_IER_64HZ_IE_Pos                                    (8U)
#define    RTC_IER_64HZ_IE_Msk                                    (0x1U << RTC_IER_64HZ_IE_Pos)
#define    RTC_IER_64HZ_IE                                        RTC_IER_64HZ_IE_Msk

#define    RTC_IER_16HZ_IE_Pos                                    (7U)
#define    RTC_IER_16HZ_IE_Msk                                    (0x1U << RTC_IER_16HZ_IE_Pos)
#define    RTC_IER_16HZ_IE                                        RTC_IER_16HZ_IE_Msk

#define    RTC_IER_8HZ_IE_Pos                                     (6U)
#define    RTC_IER_8HZ_IE_Msk                                     (0x1U << RTC_IER_8HZ_IE_Pos)
#define    RTC_IER_8HZ_IE                                         RTC_IER_8HZ_IE_Msk

#define    RTC_IER_4HZ_IE_Pos                                     (5U)
#define    RTC_IER_4HZ_IE_Msk                                     (0x1U << RTC_IER_4HZ_IE_Pos)
#define    RTC_IER_4HZ_IE                                         RTC_IER_4HZ_IE_Msk

#define    RTC_IER_2HZ_IE_Pos                                     (4U)
#define    RTC_IER_2HZ_IE_Msk                                     (0x1U << RTC_IER_2HZ_IE_Pos)
#define    RTC_IER_2HZ_IE                                         RTC_IER_2HZ_IE_Msk

#define    RTC_IER_SEC_IE_Pos                                     (3U)
#define    RTC_IER_SEC_IE_Msk                                     (0x1U << RTC_IER_SEC_IE_Pos)
#define    RTC_IER_SEC_IE                                         RTC_IER_SEC_IE_Msk

#define    RTC_IER_MIN_IE_Pos                                     (2U)
#define    RTC_IER_MIN_IE_Msk                                     (0x1U << RTC_IER_MIN_IE_Pos)
#define    RTC_IER_MIN_IE                                         RTC_IER_MIN_IE_Msk

#define    RTC_IER_HOUR_IE_Pos                                    (1U)
#define    RTC_IER_HOUR_IE_Msk                                    (0x1U << RTC_IER_HOUR_IE_Pos)
#define    RTC_IER_HOUR_IE                                        RTC_IER_HOUR_IE_Msk

